# 1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы
# сотрудника. В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

from sys import argv


def salary_calc():
    """ Принимает 4 параметра: имя сотрудника, выработка сотрудника в часах, почасовая ставка сотрудника,
    сумма премии сотрудника и вычисляет заработную плату сотрудника по заданной формуле. Проверяет все
    параметры, кроме имени на принадлежность к цифрам"""

    if working_hours.isdigit() and rate_per_hour.isdigit() and rate_per_hour.isdigit() and bonus.isdigit():
        print(f"Расчет заработной платы для сотрудника {name}")
        print("---" * 18)
        print(f"Выработка, час: {working_hours}")
        print(f"Почасовая ставка, руб: {rate_per_hour}")
        print(f"Сумма премии, руб: {bonus}")
        print("---" * 18)
        print(f"Итого заработная плата, руб: {float(working_hours) * float(rate_per_hour) + float(bonus)}")
    else:
        print("Расчет невозможен. Некорректные данные.")


if __name__ == '__main__':
    try:
        script_name, name, working_hours, rate_per_hour, bonus = argv
    except ValueError:
        name = input("Введите имя сотрудника, для которого производится расчет заработной платы: ")
        working_hours = input("Введите выработку в часах: ")
        rate_per_hour = input("Введите почасовую ставку: ")
        bonus = input("Введите премию сотрудника: ")
    finally:
        salary_calc()
