# УРОК 2
# 1. Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки
# типа данных каждого элемента. Использовать функцию type() для проверки типа. Элементы списка можно
# не запрашивать у пользователя, а указать явно, в программе.

print("Задание 1. Проверить тип каждого элемента списка.")

my_list = [1, "apple", 3.14, [1, 2, 3, 4, 5], None, True]

for item in my_list:
    print(type(item))

# 2. Для списка реализовать обмен значений соседних элементов, т.е. Значениями обмениваются элементы
# с индексами 0 и 1, 2 и 3 и т.д. При нечетном количестве элементов последний сохранить на своем месте.
# Для заполнения списка элементов необходимо использовать функцию input().

print()
print("Задание 2. Поменять местами значения соседних элементов списка.")

next_item = ""
my_list = []
i = 1

while next_item != "y":
    my_list.append(input("Пожалуйста, введите %d-й элемент списка: " % i))
    next_item = input("Закончить ввод? ('y' - да, любая другая клавиша - продолжить): ")
    next_item = next_item.lower()
    i += 1

print("Список до перестановки: ", my_list)
my_list_copy = my_list.copy()

i = 0
var_to_store = 0
counter = len(my_list)

if len(my_list) % 2 != 0:
    counter = len(my_list) - 1

while i < counter:
    var_to_store = my_list[i]
    my_list[i] = my_list[i+1]
    my_list[i+1] = var_to_store
    i += 2

print("Список после перестановки: ", my_list)

# 3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится
# месяц (зима, весна, лето, осень). Напишите решения через list и через dict.

print()
print("Задание 3. Сообщить пользователю, к какому времени года относится введенный им месяц.")

user_month = int(input("Введите номер месяца в виде целого числа от 1 до 12: "))

print("Вариант 1:")

season_list = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима"]

print(season_list[int(user_month-1)])

print()
print("Вариант 2:")

seasons_dict = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето",
                9: "Осень", 10: "Осень", 11: "Осень", 12: "Зима"}
print(seasons_dict.get(user_month))

# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое слово с новой
# строки. Строки необходимо пронумеровать. Если слово длинное, выводить только первые 10 букв в слове.

print()
print("Задание 4.")
string = input("Введите строку из нескольких слов, разделенных пробелами: ")

for el in enumerate(string.split(" "), 1):
    print(el[0:10])

# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга. Если в рейтинге существуют элементы с
# одинаковыми значениями, то новый элемент с тем же значением должен разместиться после них.
# Подсказка.
# Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].

print()
print("Задание 5.")

my_list = [7, 5, 3, 3, 2]
print("Первоначальный список: ", my_list)
next_item = ""

while next_item != "y":
    user_number = int(input("Введите любое натуральное (целое, положительное) число: "))
    my_list.append(user_number)
    my_list.sort(reverse=True)
    print("Новый список теперь выглядит вот так:", my_list)
    next_item = input("Закончить ввод? ('y' - да, любая другая клавиша - продолжить): ")
    next_item = next_item.lower()

# 6. * Реализовать структуру данных «Товары». Она должна представлять собой список кортежей. Каждый кортеж
# хранит информацию об отдельном товаре. В кортеже должно быть два элемента — номер товара и словарь с
# параметрами (характеристиками товара: название, цена, количество, единица измерения). Структуру нужно
# сформировать программно, т.е. запрашивать все данные у пользователя.
# Пример готовой структуры:
# [
#    (1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
#    (2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
#    (3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
# ]
# Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ — характеристика
# товара, например название, а значение — список значений-характеристик, например список названий товаров.
# Пример:
# {
#    “название”: [“компьютер”, “принтер”, “сканер”],
#    “цена”: [20000, 6000, 2000],
#    “количество”: [5, 2, 7],
#    “ед”: [“шт.”]
# }
#

print()
print("Задание 6.")
print()

next_item = ""
number = ""
key_name = "название"
key_price = "цена"
key_qty = "количество"
key_mu = "ед"

product_dict = {key_name: "", key_price: "", key_qty: "", key_mu: ""}
product_list = []
product_analytic = {key_name: [], key_price: [], key_qty: [], key_mu: []}

user_answer = input("Вы можете создать свою базу товаров с нуля ('n') или воспользоваться для "
                    "тестирования\nготовой базой (любая другая клавиша)? ")

if user_answer == "n":
    product_list = []

    while next_item != "y":
        number = input("Введите номер товара: ")
        name = input("Введите название товара: ")
        price = input("Введите цену товара: ")
        qty = input("Введите количество товара: ")
        mu = input("Введите единицы измерения товара: ")
        next_item = input("Завершить? - 'y', Продолжить - любая клавиша. ")
        next_item = next_item.lower()

        product_dict = dict({key_name: name, key_price: price, key_qty: qty, key_mu: mu})
        product_list.append((number, product_dict))

else:
    product_list = [
        (1, {"название": "компьютер", "цена": 20000, "количество": 5, "ед": "шт."}),
        (2, {"название": "принтер", "цена": 6000, "количество": 2, "ед": "шт."}),
        (3, {"название": "сканер", "цена": 2000, "количество": 7, "ед": "шт."})
    ]

print()
print("Старый список:")

for product in product_list:
    print(product)

for product in product_list:
    for key, value in product[1].items():
        if key in product_analytic:
            product_analytic[key].append(value)

print()
print("Новый словарь: ")
print()

for key, value in product_analytic.items():
    print(f"{key}: {value}")
